"""

背景介绍:很多时候我们在设计股票数据模型的时候会用到数据模型
解:一元二次方程例如:a*x*x+b*x+c=0
如果:a=0 那么这个方程是一元一次方程 b*x+c=0
                            当 b=0
                                 c=0 x可以是任意值
                            当 b=0
                                 c!=0 无解
                            当 b!=0 x=-c/b

如果:a!=0 那么这个方程是一元二次方程 b*b-4*a*c=0 这个情况下有2个相等的根
如果:a>0 有2个不等的根
如果:a<0 有2个虚根
"""
a, b, c = eval(input("a,b,c:"))
if a == 0:
    if b == 0:
        if c == 0:
            print("x为任意值")
        else:
            print("无解")
    else:
        print("x=", -1 * c / b)
else:
    dt = b * b - 4 * a * c
    if dt == 0:
        print("x1=x2=", -1 * b / 2 / a)
    elif dt > 0:
        print("x1=", (-b + dt ** 0.5) / (2 * a), ",x2=", (-b - dt ** 0.5) / (2 * a))
    else:
        print("x1=", -1 * b / 2 / a, "+", (-1 * dt) ** 0.5 / (2 * a), "i")
        print("x2=", -1 * b / 2 / a, "-", (-1 * dt) ** 0.5 / (2 * a), "i")
